app/controllers/bookmarks_controller.rb

SELECT  "hplaces".* FROM "hplaces" WHERE "hplaces"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("user2_id", "hplace_id", "place_name", "category", "place_delete", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        if params[:page]==''||params[:page].nil?
            @page='1'
        else
            @page=params[:page]
        end
        if params[:click] == 'bookmark' || 'bookmarks'
            hplace_name=Hplace.find(params[:id]).place_name
            hcategory=Hplace.find(params[:id]).category
            Bookmark.create(hplace_id:params[:id],
                            user2_id:params[:uid],
                            place_name: hplace_name,
                            category: hcategory,
                            place_delete: "no")

SELECT  "bookmarks".* FROM "bookmarks" WHERE (hplace_id ='52' and user2_id = '3') ORDER BY "bookmarks"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def destroy
        if params[:page]==''||params[:page].nil?
            @page='1'
        else
            @page=params[:page]
        end
        d = Bookmark.where(["hplace_id =? and user2_id = ?",params[:id],params[:uid]])