app/controllers/comments_controller.rb

SELECT  "hplaces".* FROM "hplaces" WHERE "hplaces"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
INSERT INTO "comments" ("hplace_id", "place_name", "category", "place_delete", "user2_id", "user_id", "content", "evalu", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT COUNT(*) FROM "comments" WHERE "comments"."hplace_id" = ?  [["hplace_id", 37]]
UPDATE "hplaces" SET "avg_evalu" = ?, "reviewcount" = ?, "updated_at" = ? WHERE "hplaces"."id" = ?  [["avg_evalu", 3.0], ["reviewcount", 1], ["updated_at", "2018-03-29 03:08:15.701096"], ["id", 37]]
---
    def create

        h=Hplace.find(params[:place_id])
        hplace_name=h.place_name
        hcategory=h.category
        if Comment.create({hplace_id: params[:place_id],
                        place_name: hplace_name,
                        category: hcategory,
                        place_delete: params[:place_delete],
                        user2_id: params[:user2_id],
                        user_id: params[:user_id],
                        content: params[:content],
                        evalu: params[:evalu]})
        cc = Comment.where({hplace_id: params[:place_id]}).count.to_f
        avg = (h.avg_evalu.to_f*(cc-1)+params[:evalu].to_f)/cc
        h.avg_evalu = avg
        h.reviewcount = h.reviewcount+1
        h.save