app/controllers/hplaces_controller.rb

    def cafe
        if params[:page]==''||params[:page].nil?
            @page='1'
        else
            @page=params[:page]
        end
        if params[:order_by]&&params[:order_by]!=""
            sort_order = params[:order_by]+" DESC"
        else
            sort_order = "avg_evalu DESC"
        end

        #byebug
        if params[:search]&&params[:select]!="*"
            if params[:select]=='place_name'
                @find=Hplace.where(['place_name LIKE ? and category=?',"%#{params[:search]}%", "cafe"]).paginate(:page =>params[:page],:per_page=>10).order(sort_order)
---
SELECT  "hplaces".* FROM "hplaces" WHERE (place_name LIKE '%la%' and category='cafe') ORDER BY avg_evalu DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

                :per_page => 10).order(sort_order)
        end
        if user2_signed_in?
            @cafbook=Bookmark.where(["category = ? and user2_id = ?","cafe",current_user2.id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE (category = 'cafe' and user2_id = 1)

    def culture
        if params[:page]==''||params[:page].nil?
            @page='1'
        else
            @page=params[:page]
        end
        if params[:order_by]&&params[:order_by]!=""
            sort_order = params[:order_by]+" DESC"
        else
            sort_order = "avg_evalu DESC"
        end
        if params[:search]&&params[:select]!="*"
            if params[:select]=='place_name'
                @find=Hplace.where(['place_name LIKE ? and category=?',"%#{params[:search]}%", "culture"]).paginate(:page =>params[:page],:per_page=>10).order(sort_order)
---
SELECT  "hplaces".* FROM "hplaces" WHERE (place_name LIKE '%q%' and category='culture') ORDER BY avg_evalu DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "hplaces" WHERE (place_name LIKE '%안%' and category='culture')


        end
        if user2_signed_in?
        @culbook=Bookmark.where(["category = ? and user2_id = ?","culture",current_user2.id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE (category = 'culture' and user2_id = 1)

    def food
        if params[:page]==''||params[:page].nil?
            @page='1'
        else
            @page=params[:page]
        end
        if params[:order_by]&&params[:order_by]!=""
            sort_order = params[:order_by]+" DESC"
        else
            sort_order = "avg_evalu DESC"
        end
        if params[:search]&&params[:select]!="*"
            if params[:select]=='place_name'
                @find=Hplace.where(['place_name LIKE ? and category=?',"%#{params[:search]}%", "food"]).paginate(:page =>params[:page],:per_page=>10).order(sort_order)
---
SELECT  "hplaces".* FROM "hplaces" WHERE (place_name LIKE '%김치%' and category='food') ORDER BY avg_evalu DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "hplaces" WHERE (place_name LIKE '%김치%' and category='food')

                :per_page => 10).order(sort_order)
        end
        if user2_signed_in?
            @fodbook=Bookmark.where(["category = ? and user2_id = ?","food",current_user2.id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE (category = 'food' and user2_id = 1)

    def show
        @hplace=Hplace.find_by_id(params[:id])
        if !@hplace.nil?
            @hplace.views = @hplace.views+1
            @hplace.save
            if params[:page]==''||params[:page].nil?
                @page='1'
            else
                @page=params[:page]
            end
            puts params[:click]
            if user2_signed_in? || params[:click] == "updatecomment"
                @click = params[:click]
                @wascomment=Comment.where(["hplace_id = ? and user2_id = ?",params[:id].to_i,current_user2.id])
            end
            #@comments=Comment.where(["hplace_id = ?",params[:id]])
            #.paginate(:page => params[:page],:per_page => 10).order('created_at DESC')
            if user2_signed_in?
            b=Bookmark.where(["hplace_id = ? and user2_id = ?",params[:id].to_i,current_user2.id])
---
SELECT  "hplaces".* FROM "hplaces" WHERE "hplaces"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "hplaces" SET "views" = ?, "updated_at" = ? WHERE "hplaces"."id" = ?  [["views", 1], ["updated_at", "2018-03-29 03:08:10.660997"], ["id", 37]]
SELECT  "comments".* FROM "comments" WHERE (hplace_id = 52 and user2_id = 3) ORDER BY "comments"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE (hplace_id = 37 and user2_id = 1) ORDER BY "bookmarks"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def edit
        if params[:page]==''||params[:page].nil?
            @page='1'
        else
            @page=params[:page]
        end
        @hplace=Hplace.find(params[:id])
---
SELECT  "hplaces".* FROM "hplaces" WHERE "hplaces"."id" = ? LIMIT ?  [["id", 143], ["LIMIT", 1]]

    def destroy
        @hplace = Hplace.find(params[:id])
        ctg = @hplace.category
        @hplace.destroy
        @commentsupdate=Comment.where(["hplace_id = ?",params[:id]])
---
SELECT  "hplaces".* FROM "hplaces" WHERE "hplaces"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
DELETE FROM "hplaces" WHERE "hplaces"."id" = ?  [["id", 37]]
SELECT "comments".* FROM "comments" WHERE (hplace_id = '37')

    def update
        pp = Hplace.find(params[:id])
        pp.place_name = params[:pname]
        pp.place_address = params[:paddress]
        pp.place_call = params[:pcall]
        pp.optime = params[:poptime]
        pp.site = params[:psite]
        pp.park = params[:ppark]
        pp.ad = params[:pad]
        pp.category = params[:pcategory]
        pp.remarks = params[:premark]
        pp.intro = params[:pintro]
        pp.place_photo1 = params[:photo1]
        pp.place_photo2 = params[:photo2]
        pp.place_photo3 = params[:photo3]
        pp.place_photo4 = params[:photo4]
        pp.place_photo5 = params[:photo5]
        pp.save
---
SELECT  "hplaces".* FROM "hplaces" WHERE "hplaces"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
UPDATE "hplaces" SET "place_name" = ?, "remarks" = ?, "place_photo1" = ?, "updated_at" = ? WHERE "hplaces"."id" = ?  [["place_name", "1영화"], ["remarks", ""], ["place_photo1", nil], ["updated_at", "2018-03-29 08:24:39.825809"], ["id", 38]]

    def create
        np = Hplace.create({place_name: params[:pname],
                        place_address: params[:paddress],
                        place_call: params[:pcall],
                        site: params[:psite],
                         optime: params[:poptime],
                          park: params[:ppark],
                          ad: params[:pad],
                          category: params[:pcategory],
                          remarks: params[:premark],
                          place_photo1:params[:photo1],
                          place_photo2:params[:photo2],
                          place_photo3:params[:photo3],
                          place_photo4:params[:photo4],
                          place_photo5:params[:photo5],
                        intro:params[:pintro]
                    })
---
INSERT INTO "hplaces" ("place_name", "place_address", "place_call", "site", "optime", "park", "ad", "category", "remarks", "intro", "created_at", "updated_at", "place_photo1") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)