app/controllers/users_controller.rb

SELECT  "hplaces".* FROM "hplaces" WHERE (category ='food' and ad ='no') ORDER BY avg_evalu DESC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @hotfood=Hplace.where(["category =? and ad =?",'food','no']).order("avg_evalu DESC")

SELECT  "user2s".* FROM "user2s" WHERE (email = '1project@stayes.com') ORDER BY "user2s"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def mypage
        if user2_signed_in?
            @myinfos=User2.where(["email = ?",current_user2.email])

SELECT  "comments".* FROM "comments" WHERE (user2_id = 3) ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE (user2_id = 3)
---
    def mycomment
        if user2_signed_in?
        @mycomments=Comment.where(["user2_id = ?",current_user2.id]).paginate(:page => params[:page],
            :per_page => 10).order('created_at DESC')

SELECT  "bookmarks".* FROM "bookmarks" WHERE (user2_id = 3 ) ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
    def mybookmark
        if user2_signed_in?
            @mybookmarks = Bookmark.where(["user2_id = ? ",current_user2.id]).paginate(:page => params[:page],
                :per_page => 10).order('created_at DESC')

SELECT  "user2s".* FROM "user2s" WHERE (user_id LIKE '%1%') ORDER BY created_at LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "user2s" WHERE (user_id LIKE '%1%')
---
    def memberpage
        if params[:page]==''||params[:page].nil?
            @page='1'
        else
            @page=params[:page]
        end
        @users=User2.paginate(:page =>params[:page],:per_page=>10).order('created_at')

SELECT  "user2s".* FROM "user2s" WHERE "user2s"."id" = ? ORDER BY "user2s"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        if params[:page]==''||params[:page].nil?
            @page='1'
        else
            @page=params[:page]
        end
        @detail=User2.find(params[:id])

SELECT  "user2s".* FROM "user2s" WHERE "user2s"."id" = ? ORDER BY "user2s"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        if params[:page]==''||params[:page].nil?
            @page='1'
        else
            @page=params[:page]
        end
        @user=User2.find(params[:id])

SELECT  "user2s".* FROM "user2s" WHERE (email = '1project@stayes.com') ORDER BY "user2s"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
     def mypage_edit
        if !current_user2.nil?
            @myinfos=User2.where(["email = ?",current_user2.email])

SELECT  "user2s".* FROM "user2s" WHERE "user2s"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "user2s" SET "phone" = ?, "updated_at" = ? WHERE "user2s"."id" = ?  [["phone", "01023222766"], ["updated_at", "2018-03-29 07:53:13.425693"], ["id", 3]]
---
     def mypage_update
        m = User2.find(params[:id])

        if !params[:mphone].nil?
            m.update(phone:params[:mphone])

SELECT  "user2s".* FROM "user2s" WHERE "user2s"."id" = ? ORDER BY "user2s"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "user2s" SET "user_delete" = ?, "updated_at" = ? WHERE "user2s"."id" = ?  [["user_delete", "destroy"], ["updated_at", "2018-03-29 08:19:49.843458"], ["id", 3]]
---
     def userdelete
        m = User2.find(params[:id])
        m.user_delete="destroy"
        m.save