app/views/hplaces/show.html.erb

SELECT  "comments".* FROM "comments" WHERE (hplace_id = 52 and user2_id = 3) ORDER BY "comments"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
<%if user2_signed_in?%>
<%@hplace.comments.each do |c|%>